// 1 урок з ментором
//

// .......................................................

// .......................................................

// Напишіть 3 цикла:
// // 1й цикл: выводить в консоль числа від max до min по зменшеню (убыванию).
// // 2й цикл: виводить в консоль усі парні (четные) числа від min до max.
// // 3й цикл: виводить в консоль суму усіх парних (четных) чисел від min до max
// const max = 50;
// const min = 23;

// const max = 50;
// const min = 23;
// let total = 0;
// // for (let i = min; i <= max; i += 1) {
// //   if (i % 2 === 0) {
// //     console.log(i);
// //   }
// // }
// for (let i = 0; i <= max; i += 1) {
//   if (i % 2 === 0) {
//     total += i;
//   }
// }
// console.log(total);

//

// .......................................................
/** Замовлення турів
 Пишемо реєстрацію користувача за допомогою prompt. Окремо логін та пароль.
 Логінізація: запитуємо логін та пароль, порівнюємо їх 
 (виводимо Try again, або Login success.)
 Запитуємо максимальну суму, яку ви готові витратити на тур.
 Виводимо список всіх країн в alert. які доступні для користувача по його сумі.
 Вказуємо країну через prompt і купляємо тур.
 Виводимо повідомлення, що тур оплачено і залишок на рахунку користувача.
*/

// const countries = [
//   'Ukraine',
//   'Poland',
//   'Croatia',
//   'Montenegro',
//   'France',
//   'USA',
// ];
// const countriesPrice = [100, 200, 300, 400, 500, 600];
//
// let userInput;
// let userName;
// let userPass;
// let usersList;
